app/controllers/channels_controller.rb

    def load_channel
      authenticate_user!
      @user = current_user
      @channel = @user.channels.find(params[:id])
---
SELECT  "channels".* FROM "channels"  WHERE "channels"."user_id" = 695 AND "channels"."id" = $1 AND ("channels".deleted_at IS NULL) LIMIT 1