app/controllers/users_controller.rb

  def load_user
    authenticate_user!
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1